a1='название' # a1=input('Введите название: ')
list_a1=[a1]*3
b1_1='компьютер' # b1_1=input('Введите значения названий: ')
b1_2='принтер' # b1_2=input('Введите значения названий: ')
b1_3='сканер' # b1_3=input('Введите значения названий: ')
b1=[b1_1,b1_2,b1_3]
s1={a1:b1}

a2='цена'
list_a2=[a2]*3
b2_1=20000
b2_2=6000
b2_3=2000
b2=[b2_1,b2_2,b2_3]
s2={a2:b2}

a3='количество'
list_a3=[a3]*3
b3_1=5
b3_2=2
b3_3=7
b3=[b3_1,b3_2,b3_3]
s3={a3:b3}

a4='ед.'
list_a4=[a4]*3
b4_1='шт.'
b4=[b4_1]*3
s4={a4:b4_1}

s=s1,s2,s3,s4
print(s,'\n')

n0=[]
i=0
while i<len(b1):
    dic={list_a1[i]:b1[i],list_a2[i]:b2[i],list_a3[i]:b3[i],list_a4[i]:b4[i]}
    i+=1
    n=i,dic
#     n0+=n
# print(n0)
    print(n)
